# StairstypeHasIntermediateSupport Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeHasIntermediateSupport Property
ParameterTypeId Class See Also
---
"Middle Support": Whether stairs is assembled
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeHasIntermediateSupport { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeHasIntermediateSupport As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeHasIntermediateSupport {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace